update delivery_plan database and create templates
